package g_Chapter06;
// 메서드

// 특정 작업을 수행하는 일련의 문장들을 하나로 묶은 것
// 어떤 값을 입력하면 해당 값으로 작업을 수행하여 결과를 반환

// 메서드의 구조
// 선언부, 구현부

//1. 메서드의 선언부
// 반환타입, 메서드명 ,매개변수 선언

// 반환타입 메서드명 () : 선언부
// { 메서드 호출 시 수행될 코드} 구현부
// 메서드를 정의한다 == 선업부와 구현부를 작성한다

// 매개변수 선언(parameter)
// : 메서드가 작업을 수행하는데 필요한 값들을 제공받기 위한 것
// : 필요한 값의 개수만큼 변수를 선언하여 각 변수 간의 구분은 쉼표(,) 를 사용
// : 변수들의 데이터 타이빙 같더라도 변수의 타입을 생략할 수 없다. ex)  int add(int x,y){...}  - Err

// 반환 타입(return type)
// : 메서드의 작업수행 결과(출력)인 반환값의 타입을 명시
// : 반환값이 없는 경우 void 키워드를 사용

// 매서드의 구현부
// 메서드 선언부 다음에 오는 중괄호{}

// return문
// : 메서드의 반환타입이 void가 아닌 경우
// : 구현부 {} 안에는 반드시 'return 반환값'이 포함되어야한다.
// 해당 반환값은 반환타입이 일치하거나 적어도 자동 형변환이 가능한것

// return문은 단 하나의 값만을 반환 가능

// 지역 변수(local variable)
// : 메서드 내에 선언된 변수 - 그 메서드 내에서만 사용 가능
// : 메서드의 구현부에 작성된 변수 뿐만 아니라 매개변수도 메서드 내에서 선언된 것으로 간주
// : 매개변수도 메서드 내에서 선언된 것으로 간주하기 때문에 지역변수로 간주한다.

class Example {

	// add 메서드
	// 두개의 정수를 전달 받아서 , 두 값을 더한 결과를 반환

	// int 반환타입
	// add 메서드명
	// (int x, int y) : 매개변수선언
	int add(int x, int y) {
		int result = x + y;
		return result;
	}

	// 메서드 내에 선언된 지역 변수는 해당 메서드 내에서만 사용할 수 있기 때문에
	int multiply(int x, int y) {
		int result = x * y;
		return result;
	}

	void print99danAll() {
		for (int i = 2; i <= 9; i++) {
			for (int j = 1; j <= 9; j++) {
				System.out.print(j * i + " ");
			}
			System.out.println();
		}
	}
}

public class Method02 {
	// 클래스 파일
	// main 메서드

	// public : main 메서드가 프로그램의 어디서든 호출가능
	// static : main 메서드가 인스턴스 없이도 호출 가능
	// void : 메서드가 어떤 값을 반환하지 않음
	// main : 메서드 명
	// (String[] args) : 메서드 매개변수로 String 타입의 배열을 전달받음
	
	public static void main(String[] args) {
		Example ex = new Example();

		// 메서드 정의 후 호출이 되어야만 구현부{} 내의 문장이 수행
		// 메서드 호출 방법
		// : 메서드명(메서드 정의 시 작성한 매개변수 작성)
		ex.print99danAll();
		System.out.println(ex.add(10, 20));

		// 인수 & 매개변수
		// 인수(인자)란 ?
		// 메서드를 호출할 때 소괄호() 안에 지정해준 값
		// 인자의 개수와 순서는 반드시 호출된 메서드에 선언된 매개변수와 일치
		// ex.add(10,20,30); - Error ( 받는 매개변수는 2개인데 3개를 전달 하려하고있다.)
		// ex.add(10.0, 20.0); - Error (double 타입을 int 타입에 사용 x)
		ex.add('a', 'b'); // char 타입은 int 타입으로 자동 형 변환이 되기때문에 오류 x

		
		String message = "이것은  지역변수입니다.";
		
		//클래스 파일
		// main  메서드
		// : 생성한 클래스 파일을 실행(ctrl +f11)하는 경우
		// : 자바 런타임 환경이 main 메서드를 찾아 실행
		
	}

}
